results/results_r5_large/results_r5_large_run2/oltp_read_only_t16/sysbench.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 41.09 qps: 671.67 (r/w/o: 587.88/0.00/83.78) lat (ms,95%): 816.63 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 57.40 qps: 916.43 (r/w/o: 801.82/0.00/114.60) lat (ms,95%): 569.67 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 57.20 qps: 914.90 (r/w/o: 800.30/0.00/114.60) lat (ms,95%): 669.89 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 49.40 qps: 791.90 (r/w/o: 693.10/0.00/98.80) lat (ms,95%): 694.45 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 51.80 qps: 827.90 (r/w/o: 724.40/0.00/103.50) lat (ms,95%): 657.93 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 48.60 qps: 778.10 (r/w/o: 680.80/0.00/97.30) lat (ms,95%): 707.07 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 42.60 qps: 680.00 (r/w/o: 594.80/0.00/85.20) lat (ms,95%): 759.88 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 43.60 qps: 698.20 (r/w/o: 611.10/0.00/87.10) lat (ms,95%): 719.92 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 65.20 qps: 1045.40 (r/w/o: 914.90/0.00/130.50) lat (ms,95%): 520.62 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 46.40 qps: 740.00 (r/w/o: 647.20/0.00/92.80) lat (ms,95%): 802.05 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 48.40 qps: 775.50 (r/w/o: 678.70/0.00/96.80) lat (ms,95%): 787.74 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 46.50 qps: 741.30 (r/w/o: 648.40/0.00/92.90) lat (ms,95%): 787.74 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            83972
        write:                           0
        other:                           11996
        total:                           95968
    transactions:                        5998   (49.72 per sec.)
    queries:                             95968  (795.52 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      49.7199
    time elapsed:                        120.6359s
    total number of events:              5998

Latency (ms):
         min:                                   42.83
         avg:                                  320.97
         max:                                 1106.83
         95th percentile:                      707.07
         sum:                              1925204.90

Threads fairness:
    events (avg/stddev):           374.8750/10.45
    execution time (avg/stddev):   120.3253/0.19